app/controllers/sessions_controller.rb

  def create
     user = User.find_or_create_by(:id => auth['uid']) do |u|
---
INSERT INTO "users" ("id", "created_at", "updated_at") VALUES (?, ?, ?)  [["id", 1], ["created_at", "2017-03-08 21:02:54.395027"], ["updated_at", "2017-03-08 21:02:54.395027"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = 1 LIMIT 1